# Terraform plan for staging
  
  ```
  Plan: 4 to add, 0 to change, 0 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  google_storage_bucket.terraform_remote_backend: Refreshing state... [id=stg-terraform-remote-backend.piny940.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=stg-clubroom.piny940.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions will be created
  + resource "google_iam_workload_identity_pool_provider" "terraform_github_actions" {
      + attribute_condition                = "assertion.repository == \"piny940/infra\" && assertion.environment == \"staging\""
      + attribute_mapping                  = {
          + "google.subject" = "assertion.sub"
        }
      + description                        = "for Terraform GitHub Actions"
      + display_name                       = "Terrform GitHub Actions"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "stg-piny940"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "default"
      + workload_identity_pool_provider_id = "terraform-github-actions"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.terraform.google_project_iam_member.terraform_github_actions_editor will be created
  + resource "google_project_iam_member" "terraform_github_actions_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com"
      + project = "stg-piny940"
      + role    = "roles/owner"
    }

  # module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user will be created
  + resource "google_project_iam_member" "terraform_github_actions_workload_identity_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com"
      + project = "stg-piny940"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user will be created
  + resource "google_service_account_iam_member" "terraform_github_actions_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/default/subject/repo:piny940/infra:environment:staging"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
Please apply the changes to the staging environment using the [Terraform apply workflow](https://github.com/piny940/infra/actions/workflows/tf-apply.yaml)
